package java1.c조건문반복문;

public class EX3_FOR {//class s
	public static void main(String[] args) {//main s
		
		
		//1.//p150 1~10까지 출력
		for(int i=1;i<=10;i++) {//1.초기값;2.조건문;3.증감식
		//i는 1부터 10이하까지 1씩 증가
			System.out.print(i);
		}
		//2.p154.
		int i =1;			//1.초기값
		while(i<=10) {		//2.조건문
			System.out.println(i);//3.실행문
			i++;
		}//while end
		
		//-------------------------------------------------//
		//p151 1~100누적합계
			//1. for
		int 합계=0;
		for(int j=1;j<=100;j++) {
			합계 +=j;
		}
		int 합계2=0;
		int h=1;
		while(h<=100) {
			합계2+=h;
			h++;
		}
		System.out.println("1---"+합계);
		System.out.println("2---"+합계2);
	//---------------------------------------------------------//
		//예3)1~100 중 7배수의 누적합계
		int 예3합=0;
		for(int x=0;x<=100;x++) {
			if(x%7==0) 예3합 +=x;
		}
		System.out.println("예3 결과:"+예3합);
		//2.
		int 예3합2=0;
		for(int x=0;x<=100;x+=7) {
			예3합2 +=x;
		}
		System.out.println("예3 결과:"+예3합2);
		
		//---------------------------------------------------------//
		//예4) 2단 구구단 출력 for 문
		for(int 곱=1;곱<=9;곱++) {
			
			System.out.println("2 x"+곱+"="+곱*2);
		}
		//while문
		int 곱2=1;
		while(곱2<=9) {
			int 연산결과=2*곱2;
			System.out.println("2 x"+곱2+"="+곱2*2);
			곱2++;
		}
		//---------------------------------------------------------//
		
		//1.구구단
		/*
		  단 : 2부터 9까지 1씩 증가 ->8번
		  곱 : 1부터 9까지 1씩 증가 ->9번
		  ---곱은 단1번 당 곱은 모두(9번) 실행 -- 단 마다 곱은 9개 존재-- 단 이 곱을 포함하고 있다 
		 */
		int 실행횟수= 0;
		for(int 단=2;단<=9;단++) {//단 2~9			[8회]
			//단 2부터 9까지 1씩 증가
			for(int 곱=1;곱<=9;곱++) {//곱1~9		[9회]단 1회 마다 곱 모두(9회) 실행[8*9=>72]
				//곱 1부터9까지 증가
 				System.out.printf("%d X %d=%2d \n",단 , 곱 ,(단*곱));
			실행횟수++;
			}
		}
		System.out.println("총 반복횟수"+실행횟수);
	
		//2.무한루프 = 무한루프
		//for(int y=0;true;y++) {
		//	System.out.println("실행");
		//}
		
		//while(true) {
		//	System.out.println("실행");
		//}
		
		//3
			//1. break : 반복문 종료 키워드[ 가장 가까운 반복문 탈출]
			//2. continue : 반복문 으로 이동 키워드[증감식으로 이동]
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}//main e
	
}//class e
/*

		반복문 : 조건이 true이면 실행문 반복 
			/조건 반복 = for/ 무한 반복 = while 사용
			1.for(1.초기값:2.조건문;3.증감식){실행문}
			2.
				초기값
				while(조건문){
					실행문
					증감식
				}
			
			
		
		
*/